export default (function(){
    function term_text1_(){
        return `
        제 1 조 (목 적)
    이 서비스 이용약관(이하 ”약관”이라고 합니다.)은 ㈜벽촌(이하 “회사”라 합니다.)가 제공하는 서비스와 관련하여 회사와 회원 간에 서비스의 이용 조건 및 절차, 권리와 의무 및 책임 사항 등의 필요한 사항을 규정함을 목적으로 합니다.
    
    제 2 조 (용어의 정의)
    이 약관에서 사용하는 용어의 정의는 다음 각호와 같으며, 정의되지 않은 용어에 대한 해석은 관계법령 및 서비스 안내에서 정하는 바에 따릅니다.
    1)	서비스 : 회원이 PC, 스마트폰 등의 각종 유무선 기기 또는 프로그램을 통하여 이용할 수 있도록 회사가 제공하는 서비스를 말합니다.
    2)	회원 : 이 약관에 동의하고 회사와 이용 계약을 체결하여, 회사가 제공하는 서비스를 사용하는 자를 말합니다.
    3)	회원정보 : 회원의 개인정보를 말합니다.
    4)	ID : 회원의 식별과 회원의 서비스 이용을 위하여 사용되는 식별 정보를 말합니다.
    5)	비밀번호 : 회원의 서비스 이용을 위해 설정하는 문자와 숫자, 특수문자의 조합을 말합니다.
    6)	사이버머니 : 회원이 서비스에서 현금처럼 사용하는 가상의 화폐를 말합니다.
    7)	포인트 : 회사가 회원에게 서비스에서 사용할 수 있도록 부여하는 환가성이 없는 무형의 포인트를 말합니다.
    8)	게시물 : 회원이 서비스에 게시하는 부호, 문자, 음성, 음향, 영상, 이미지. 파일 등을 말합니다.
    
    제 3 조 (약관의 효력 및 변경)
    1)	이 약관은 서비스 화면에 게시하거나 회원에게 공지함으로써 효력이 발생합니다.
    2)	회사는 약관의 규제에 관한 법률 등의 관계법령에 위배되지 않는 범위 내에서 이 약관을 개정할 수 있습니다.
    3)	회사는 약관을 개정할 경우 그 개정 이유를 명시하여 현행 약관과 함께 적용일자 7일 전부터 적용일 전일까지 제1항의 방법으로 공지합니다. 다만, 회원의 권리 또는 의무에 관한 중요한 규정의 변경은 최소한 30일 전에 공지하고 회원이 회사에 등록한 연락처로 통지합니다.
    4)	회사가 제3항에 따라 개정약관을 공지 또는 통지하면서 회원에게 약관 변경 적용일까지 거부의사를 표시하지 않으면 의사표시가 표명된 것으로 본다는 뜻을 공지하였음에도 불구하고 회원이 명시적으로 거부의사를 표시하지 아니하는 경우 회원이 개정약관에 동의한 것으로 봅니다.
    5)	회원은 변경된 약관에 동의하지 아니하는 경우 서비스의 이용을 중단하고 이용계약을 해지할 수 있습니다.
    
    제 4 조 (약관 외 준칙)
    이 약관에 명시되지 않은 사항에 관계법령 및 회사가 정한 서비스의 세부이용지침 등의 규정에 따릅니다.
    
    제 5 조 (이용계약의 성립)
    1)	서비스 이용계약은 회원이 이 약관 등에 동의하고, 회사가 정한 신청양식을 작성하여 서비스의 이용을 신청한 후 회사가 이를 승낙함으로써 성립합니다.
    2)	회원이 회사에 제공하는 정보는 회원의 실제 정보인 것으로 간주되고, 실제정보를 입력하지 않은 회원은 서비스 이용에 제한을 받을 수 있습니다.
    3)	만14세 미만의 아동이 서비스를 이용하기 위해서는 회사가 욕하는 소정의 법정대리인의 동의절차를 거쳐야 합니다.
    4)	회원은 서비스를 이용하면서 회원정보가 변경되었을 경우 지체없이 회원정보를 수정하여야 합니다.
    
    제 6 조 (서비스의 이용)
    1)	회사는 회원의 이용신청을 승낙한 때부터 서비스를 개시합니다. 다만, 일부 서비스의 경우에는 지정된 일자부터 서비스를 개시합니다.
    2)	회사의 업무상ㆍ기술상의 장애로 인하여 서비스를 개시하지 못하는 경우에는 서비스에 공지하거나 회원에게 이를 통지합니다.
    3)	서비스의 이용은 연중무휴 1일 24시간을 원칙으로 합니다. 다만, 회사의 업무상ㆍ기술상 또는 서비스 운영정책상 서비스가 일시 중지될 수 있습니다. 이러한 경우 회사는 사전 또는 사후에 이를 공지합니다.
    
    제 7 조 (서비스의 변경 및 중지)
    1)	회사는 서비스(개별 서비스 포함)를 변경하여야 하는 상당한 이유가 있는 경우 변경될 서비스의 내용 및 제공일자를 회원에게 통지하고 서비스를 변경하여 제공할 수 있습니다.
    2)	회사는 다음 각 호에 해당하는 경우 서비스의 전부 또는 일부를 제한하거나 중지할 수 있습니다. 이 경우 회사는 제한 또는 중단 사유를 사전에 공지합니다.    
    ①	서비스용 설비의 보수 등 공사로 인한 부득이한 경우
    ②	회사가 통제하기 곤란한 사정으로 불가피하게 서비스 제한 또는 중단이 필요한 경우
    ③	 회원이 회사의 영업활동을 방해하는 경우
    ④	정전, 제반 설비의 장애 또는 서비스 이용양의 폭주 등으로 정상적인 서비스 이용에 지장이 있는 경우
    ⑤	새로운 서비스로의 교체, 개별 서비스를 회사가 운영하는 다른 사이트로 이전하는 등 회사의 서비스 운영정책상 서비스의 제한 또는 중단이 필요하다고 판단하는 경우
    ⑥	제휴업체와의 계약종료 등과 같은 회사의 제반사정으로 서비스를 유지할 수 없는 경우
    ⑦	기타 천재지변, 국가비상사태 등 불가항력적 사유가 있는 경우
    3)	회사는 비실명인 회원, 미성년자인 회원, 법인 및 단체 회원 등 서비스의 이용을 제한할 수 있으며, 이러한 서비스 제한에 대한 사항은 별도로 안내 또는 공지합니다.
    
    제 8 조 (광고 게재 등)
    1)	회사는 서비스를 운영함에 있어 각종 정보를 서비스 화면에 게재하거나 메일 등의 방법으로 회원에게 제공할 수 있습니다.
    2)	회사는 서비스의 운영과 관련하여 광고 등을 서비스 화면에 게재하거나, 메일이나 SMS 등을 통하여 회원에게 발송할 수 있습니다. 다만, 회사는 회원에게 메일, SMS 등을 발송하는 경우 수신 동의한 회원에 한하여 이를 발송합니다.
    3)	회원이 서비스상에 게재되어 있는 광고를 이용하거나 서비스를 통한 광고주의 판촉활동에 참여하는 등의 방법으로 교신 또는 거래를 하는 것은 전적으로 회원과 광고주 간의 문제입니다. 만약, 회원과 광고주 간에 문제가 발생할 경우에도 회원과 광고주가 직접 해결하여야 하며, 이와 관련하여 회사는 책임을 지지 않습니다.
    
    제 9 조 (회원의 게시물)
    회사는 회원이 서비스에 게시하거나 전달하는 서비스내의 게시물이 다음 각 호의 경우에 해당한다고 판단되는 경우 사전 통지 없이 삭제할 수 있습니다.
    ①	제3자를 비방하거나 명예를 손상시키는 내용인 경우
    ②	공공질서 및 미풍양속에 위반되는 경우
    ③	범죄적 행위에 결부되는 내용인 경우
    ④	제3자의 저작권 등 기타 타인의 권리를 침해하는 내용인 경우
    ⑤	회사의 서비스와 관련 없는 내용인 경우
    ⑥	불필요하거나 승인되지 않은 광고, 판촉물을 게재하는 경우
    ⑦	타인의 ID, 명의 등을 무단으로 도용하여 작성한 내용이거나, 타인이 입력한 정보를 무단으로 위ㆍ변조한 내용인 경우
    ⑧	동일한 내용을 중복하여 다수 게시하는 등 게시의 목적에 어긋나는 경우
    ⑨	관계법령 및 회사의 개별서비스별 세부이용지침 등에 위반된다고 판단되는 경우
    
    제 10 조 (게시물의 저작권)
    1)	회원이 서비스 내에 게시한 게시물의 저작권은 저작권법에 의해 보호를 받으며, 회사가 작성한 저작물에 대한 저작권 기타 지적재산권은 회사에 귀속합니다.
    2)	회원은 자신이 서비스 내에 게시한 게시물을 회사가 국내ㆍ외에서 다음 각 호의 목적으로 사용하는 것을 허락합니다.
    ①	서비스(제3자가 운영하는 사이트 또는 미디어의 일정 영역 내에 입점하여 서비스가 제공되는 경우를 포함)내에서 게시물을 사용하기 위하여 게시물의 크기를 변환하거나 단순화하는 등의 방식으로 수정하는 것
    ②	회사에서 운영하는 다른 서비스 또는 다른 회사가 운영하는 서비스 게시물을 복제ㆍ전송ㆍ전시하는 것. 다만, 회원이 게시물의 복제ㆍ전송ㆍ전시에 동의하지 아니할 경우에는 그러하지 않습니다.
    ③	회사의 서비스를 홍보하기 위한 목적으로 미디어, 통신사 등에게 게시물의 내용을 보도, 방영하게 하는 것. 다만, 이 경우 회사는 회원의 개별 동의없이 미디어, 통신사 등에게 회원정보를 제공하지 않습니다.
    3)	회원이 서비스에 게시물을 게재하는 것은 다른 회원이 게시물을 서비스 내에서 사용하거나 회사가 검색결과로 사용하는 것을 허락한 것으로 봅니다.
    4)	회원이 이용계약을 해지하거나, 회사가 이용계약을 해지하는 경우, 회원이 서비스에 게시한 게시물은 삭제됩니다. 다만, 다른 회원 또는 제3자에게 의하여 다시 게시된 게시물, 공유게시판, 댓글 등 공유 서비스 내에 게재된 게시물 등 다른 회원의 정상적인 서비스 이용에 필요한 게시물은 삭제되지 않습니다.
    5)	회사는 서비스 운영정책상 게시물의 내용을 변경하지 아니하고 게시물의 게재위치를 변경ㆍ이전할 수 있으며, 게시물의 변경ㆍ이전하는 경우에는 사전에 공지합니다.
    
    제 11 조 (포인트 이용)
    1)	회사는 회원에게 포인트를 부여할 수 있고, 회사는 포인트 획득, 사용방법, 소멸 등에 관한 세부이용지침을 별도로 정하여 시행할 수 있습니다.
    2)	회원이 부정한 방법으로 포인트를 획득한 경우 회사는 회원의 포인트 회수 등의 필요 조치를 취할 수 있습니다.
    
    제 12 조 (회사의 의무)
    1)	회사는 회원의 회원정보를 보호하기 위해 보안시스템을 구축 운영하며, “개인정보처리방침”을 공지하고 준수합니다. 또한, 회사는 “개인정보처리방침” 따라 회원정보를 처리함에 있어 안정성 확보에 필요한 기술적 및 관리적 대책을 수립ㆍ운영합니다.
    2)	회사는 서비스와 관련한 회원의 불만사항이 접수되는 경우 이를 신속하게 처리하여야 합니다.
    3)	회사가 제공하는 서비스로 인하여 회원에게 손해가 발생한 경우 그러한 손해가 회사의 고의나 중과실에 기해 발생한 경우에 한하여 회사에서 책임을 부담하며, 그 책임의 범위는 통상손해에 한합니다.
    
    제 13 조 (회원의 의무)
    1)	회원은 관계법령, 약관, 서비스 이용안내 및 서비스상에 공지한 주의사항, 회사가 서비스 이용과 관련하여 회원에게 통지하는 사항 등을 준수하여야 하며, 기타 회사의 업무에 방해되는 행위를 하여서는 아니 됩니다.
    2)	회원은 회사에서 인정한 경우를 제외하고는 서비스를 이용하여 상품을 판매하는 영업 활동을 할 수 없습니다. 이를 위반하여 발생한 영업활동의 결과 및 손실에 대해 회사는 책임을 지지 않습니다.
    3)	회원은 신청양식 기재 시 또는 회원정보 변경 시 모든 사항을 사실에 근거하여 작성하여야 하며, 허위 또는 타인의 개인정보를 이용한 사실이 발견된 경우 회원은 서비스 이용과 관련한 일체의 권리를 주장할 수 없습니다.
    4)	회원은 서비스의 이용권한, 기타 서비스 이용계약상의 지위를 타인에게 양도, 증여할 수 없으며 이를 담보로 제공할 수 없습니다.
    5)	회원은 회원 ID 및 비밀번호를 스스로 관리하여야 하고, 관리소홀, 부정사용 등에 의하여 발생하는 결과에 대한 책임은 회원 본인이 부담하며, 회사는 고의 또는 중과실이 없는 한 이에 대한 책임을 부담하지 않습니다.
    6)	회원은 본인의 ID 및 비밀번호를 제3자에게 이용하게 하여서는 아니되며, 회원 본인의 ID 및 비밀번호를 도난당하거나 제3자가 사용하고 있음을 인지하는 경우에는 즉시 비밀번호를 변경해야 합니다.
    
    제 14 조 (회원에 대한 통지)
    1)	회사는 회원의 서비스 이용에 필요한 권리 및 의무 등에 관한 사항을 회원에게 통지할 경우 회원이 지정한 연락처로 통지합니다.
    2)	회사는 불특정 다수 회원에 대한 통지의 경우 서비스에 게시함으로써 개별 통지에 갈음할 수 있습니다.
    
    제 15 조 (회원정보의 보호 및 이용)
    1)	회사는 서비스 제공에 필요한 최소한의 범위 내에서 “개인정보처리방침”에 따라 회원의 회원정보를 수정합니다.
    2)	회사는 전기통신사업법, 통신비밀보호법 등의 관계법령에 따라 행정기관이나 수사기관 등에서 회원의 회원정보의 열람이나 제출을 요청하는 경우에는 이를 제공할 수 있습니다.
    3)	회사는 회원의 귀책사유로 인해 노출된 회원정보에 대해서 일체의 책임을 부담하지 않습니다.
    
    제 16 조 (계약해지 및 이용제한)
    1)	회사는 회원이 이 약관을 위반한 경우 서비스 이용을 제한하거나 이용계약을 해지할 수 있습니다.
    2)	회원은 전항에 따른 서비스 이용정지 기타 서비스 이용과 관련된 이용제한에 대해 회사가 정한 절차에 따라 이의신청을 할 수 있으며, 회사는 회원의 이의신청이 정당하다고 판단되는 경우 즉시 서비스 이용을 재개합니다.
    
    제 17 조 (손해배상)
    1)	회원이 본 약관의 규정을 위반함으로 인하여 회사에 손해가 발생하게 되는 경우, 이 약관을 위반한 회원은 회사에 발생하는 손해를 배상하여야 합니다.
    2)	회원이 서비스를 이용하는 과정에서 행한 불법행위나 이 약관 위반행위로 인하여 회사가 당해 회원 이외의 제3자로부터 손해배상 청구 또는 소송을 비롯한 각종 이의제기를 받는 경우 당해 회원은 자신의 책임과 비용으로 회사를 면책 시켜야 하며, 회사가 면책되지 못한 경우 당해 회원은 그로 인하여 회사에 발생한 모든 손해를 배상하여야 합니다.
    
    제 18 조 (면책사항)
    1)	회사는 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 관한 책임이 면책됩니다.
    2)	회사는 회원의 귀책사유로 인한 서비스 이용 장애에 대하여 책임을 지지 않습니다.
    3)	회사는 회원이 서비스를 이용하여 기대하는 수익을 상실한 것에 대하여 책임을 지지 않으며 그 밖에 서비스를 통하여 얻은 자료로 인한 손해 등에 대하여도 책임을 지지 않습니다. 회사는 회원이 사이트에 게재한 게시물의 정확성 등 내용에 대하여는 어떠한 보증도 하지 않습니다.
    4)	회사는 회원 상호간 또는 회원과 제3자 상호간에 서비스를 매개로 발생한 분쟁에 대해서는 개입할 의무가 없습니다.
    
     제 19 조 (준거법 및 관할법원)
    1)	본 약관의 해석은 대한민국법을 준거법으로 합니다.
    2)	회사와 회원 간에 소송이 제기되는 경우 민사소송법상의 법원을 관할법원으로 합니다.
        `
    }
    
    function term_text2_(){
        return `
        (주)벽촌(이하 "회사"라 합니다)는 이용자의 개인정보보호를 중요시 하며, 개인정보 보호법 등 개인정보와 관련된 법령 상의 개인정보보호 규정을 준수하고 있습니다.
    
    회사는 이용자가 회사에 제공한 개인정보가 어떠한 용도와 방식으로 이용되고 있으며 개인정보보호를 위해 어떠한 조치를 취하는지 안내합니다. 회사는 개인정보처리방침을 개정하는 경우 회사는 이를 서비스 화면에 게시하거나 이용자에게 고지합니다.
    
    이용자는 개인정보의 수집, 이용, 제공, 위탁 등에 동의하지 않는 경우 이를 거부할 수 있습니다. 다만, 이 경우 서비스 이용이 제한될 수 있습니다. 
    
    1. 개인정보의 수집 및 이용 목적
    개인정보는 생존하는 개인에 관한 정보로서 회원 개인을 식별할 수 있는 정보(당해 정보만으로는 특정 개인을 식별할 수 없더라도 다른 정보와 용이하게 결합하여 식별할 수 있는 것을 포함)를 말합니다. 회사는 다음의 목적으로 개인정보를 활용합니다.
    1)서비스 제공 및 서비스 제공에 따른 요금정산
    게시물 등록, 회원제도 운영, 수익배분, 요금 결제, 추천 서비스 등의 제공
    2)회원 관리
    본인확인, 개인식별, 부정 이용 방지, 만 14세 미만 아동 개인정보 수집 시 법정대리인 동의여부 확인, 분쟁 조정을 위한 기록보존, 불만처리 등 민원처리, 고지사항 전달
    3) 마케팅 및 광고에 활용
    이벤트 등 광고성 정보 제공
    
    2. 수집하는 개인정보 항목 및 수집방법
    [수집하는 개인정보 항목]
    1)회사는 서비스 제공을 위해 아래와 같은 정보를 수집합니다.
    
    (필수항목) 이름, 아이디, 휴대폰번호, 이메일주소
    (선택항목) 생일, 성별, 취미 
    
    2)서비스 이용과정이나 사업 처리과정에서 서비스 이용기록, 접속로그, 쿠키, 접속IP 정보, 결제기록, 휴대폰 정보(제조사, 모델명, OS 버전 등)들이 생성되어 수집될 수 있습니다.
    3)서비스 이용 과정에서 이용자의 별도 동의 절차를 거쳐 개인정보가 추가 수집될 수 있습니다.
    
    [수집방법]
    회사는 웹페이지, App, 서면, 이메일, 전화, 팩스, 상담 게시판, 제휴사 제공 등의 방법으로 개인정보를 수집합니다.
    
    3. 수집하는 개인정보의 보유 및 이용기간
    회사는 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다. 단, 상법, 
    전자상거래 등에서의 소비자보호에 관한 법률, 통신비밀보호법 등의 관련 법령에 따라 다음과 같
    은 정보를  보존할 수 있습니다. 아래 정보는 예시 입니다.
    대금결제 및 재화 등의 공급에 관한 기록 : 5년
    소비자의 불만 또는 분쟁처리에 관한 기록 : 3년
    접속기록 : 3개월
    
    4. 개인정보의 파기절차 및 방법
    회사는 원칙적으로 개인정보 수집 및 이용목적이 달성되거나, 보유 및 이용기간이 경과된 후에는 해당 정보를 지체 없이 파기합니다. 다만, 개인정보 보호법에 따라 1년 간 이용 기록이 없는 회원의 경우, 이용중인 회원의 개인정보와 별도 분리하여 안전하게 보관합니다.
    회사는 종이(인쇄물, 서면 등)에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기하고 전자적 파일형태로 저장된 개인정보는 복원이 불가능한 방법으로 영구 삭제합니다.
    
    5. 개인정보의 제공 및 공유
    회사는 이용자의 개인정보를 회원에게 동의 받은 목적에 한해서만 이용하며, 회원의 동의가 없거나 관련 법규에 의하지 않는 한 제3자에게 제공하지않습니다. 
    
    6. 개인정보 처리 위탁
    회사는 원활한 서비스 제공을 위해 아래와 같이 개인정보 처리 업무를 외부 업체에 위탁하여 운영하고 있습니다. 위탁계약 체결 시 개인정보보호의 안전을 기하기 위하여 위탁계약 내용에 개인정보보호 관련 내용을 규정하고 있습니다.
    
    [서비스 제공 수탁업체]
    수탁업체	위탁업무	개인정보의 보유 및 이용기간
            
            
            
            
    
    7. 개인정보 자동 수집 장치의 설치·운영 및 거부에 관한 사항
    이용자 개개인에게 맞춤화된 서비스를 제공하기 위해서 회사는 '쿠키(cookie)'를 사용합니다. 
    1)쿠키의 사용 목적
    접속 빈도, 방문 시간 분석, 자주 방문하는 사이트 파악 등을 통한 맞춤형 서비스 제공
    2)쿠키 설정 거부 방법
    이용자는 쿠키 설치에 대한 선택권을 가지고 있습니다. 따라서, 이용자는 웹브라우저에서 옵션을 설정함으로써 모든 쿠키를 허용하거나, 쿠키가 저장될 때마다 확인을 거치거나, 아니면 모든 쿠키의 저장을 거부할 수도 있습니다.
    
    8. 이용자의 권리와 그 행사방법
    이용자는 언제든지 등록되어 있는 자신의 개인정보를 조회하거나 수정할 수 있습니다. 
    9. 개인정보 보호책임자 및 상담·신고
    이용자의 개인정보를 보호하고 개인정보와 관련한 불만을 처리하기 위하여 회사는 아래의 개인정보 보호책임자를 두고 있습니다. 
    
    개인정보 보호책임자
    정민철 (소속 : ㈜벽촌) lawyland@naver.com
     
    개인정보 보호관리자
    정민철 (소속 : ㈜벽촌) lawyland@naver.com
    
    부칙
    1) 회사는 개인정보처리방침을 변경하는 경우 그 변경 사유를 기재하여 적용일자 7일전부터 이용자에게 알립니다. 다만, 이용자의 권리 또는 의무에 중요한 내용의 변경이 있을 경우에는 최소 30일전에 알립니다.
    
    2)회사가 제1항에 따라 변경 내용을 고지하면서 변경 적용일까지 거부의사를 표시하지 않으면 의사표시가 된 것으로 본다는 뜻을 고지하였음에도 불구하고 이용자가 명시적으로 거부의사를 표시하지 아니하는 경우 이용자가 변경 내용에 동의한 것으로 봅니다.   
        `
    }
    return {
        term_text1_,
        term_text2_
    }
})()